# feature extraction

In [ ]:
import pandas as pd
from statsmodels.stats.proportion import proportions_ztest

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.float_format', lambda x: '%.3f' % x)
pd.set_option('display.width', 500)

# binary

In [14]:
df = pd.read_csv("datasets/titanic.csv")
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S

In [15]:
df["Cabin_bool"] = df["Cabin"].notnull().astype("int")
print(df.head())
print(df["Cabin_bool"].value_counts())
#null olan değerler 0 yapılır
#null olmayan değerler 1 yapılır

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked  Cabin_bool
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S           0
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C           1
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S           0
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S           1
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S           0
Cabin_bool
0    687
1    204
Name: count, dtype: int64

In [16]:
df.groupby("Cabin_bool").agg({"Survived":"mean"})

            Survived
Cabin_bool
0              0.300
1              0.667

In [20]:
count = [df.loc[df["Cabin_bool"] == 1, "Survived"].sum(),
         df.loc[df["Cabin_bool"] == 0, "Survived"].sum()]
nobs = [df.loc[df["Cabin_bool"] == 1].shape[0],
        df.loc[df["Cabin_bool"] == 0].shape[0]]

test_stat, pvalue = proportions_ztest(count=count, nobs=nobs)
print(f"test statistic: {test_stat:.4f}, p-value: {pvalue:.4f}")

test statistic: 9.4597, p-value: 0.0000

In [22]:
df.loc[((df["SibSp"] + df["Parch"]) > 0),"Is_Alone"] = "no"
df.loc[((df["SibSp"] + df["Parch"]) == 0),"Is_Alone"] = "yes"

In [23]:
df.groupby("Is_Alone").agg({"Survived":"mean"})

          Survived
Is_Alone
no           0.506
yes          0.304

In [24]:
count = [df.loc[df["Is_Alone"] == "yes", "Survived"].sum(),
         df.loc[df["Is_Alone"] == "no", "Survived"].sum()]
nobs = [df.loc[df["Is_Alone"] == "yes"].shape[0],
        df.loc[df["Is_Alone"] == "no"].shape[0]]

test_stat, pvalue = proportions_ztest(count=count, nobs=nobs)
print(f"test statistic: {test_stat:.4f}, p-value: {pvalue:.4f}")

test statistic: -6.0704, p-value: 0.0000

# text

In [25]:
df = pd.read_csv("datasets/titanic.csv")
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S

In [29]:
def find_word_count(string):
    words = string.split()
    return len(words)

df["Letter_count"] = df["Name"].str.len()
df["Word_count"] = df["Name"].apply(find_word_count)
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked  Letter_count  Word_count
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S            23           4
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C            51           7
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S            22           3
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S            44           7
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S            24           4